In [18]:
import numpy as np
import pandas as pd

In [19]:
pd.__version__

'1.5.3'

In [20]:
df = pd.read_csv ('datasets_master_housing.csv')

In [21]:
df

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY
...,...,...,...,...,...,...,...,...,...,...
20635,-121.09,39.48,25.0,1665.0,374.0,845.0,330.0,1.5603,78100.0,INLAND
20636,-121.21,39.49,18.0,697.0,150.0,356.0,114.0,2.5568,77100.0,INLAND
20637,-121.22,39.43,17.0,2254.0,485.0,1007.0,433.0,1.7000,92300.0,INLAND
20638,-121.32,39.43,18.0,1860.0,409.0,741.0,349.0,1.8672,84700.0,INLAND
20639,-121.24,39.37,16.0,2785.0,616.0,1387.0,530.0,2.3886,89400.0,INLAND

In [22]:
df.total_bedrooms.isnull().sum()

207

In [23]:
df.ocean_proximity.nunique()

5

In [24]:
df.groupby('ocean_proximity').median_house_value.agg(['mean', 'count'])

                          mean  count
ocean_proximity
<1H OCEAN        240084.285464   9136
INLAND           124805.392001   6551
ISLAND           380440.000000      5
NEAR BAY         259212.311790   2290
NEAR OCEAN       249433.977427   2658

In [25]:
df.total_bedrooms.agg(['mean'])

mean    537.870553
Name: total_bedrooms, dtype: float64

In [26]:
df.total_bedrooms.fillna(df.total_bedrooms.mean())

0         129.0
1        1106.0
2         190.0
3         235.0
4         280.0
          ...
20635     374.0
20636     150.0
20637     485.0
20638     409.0
20639     616.0
Name: total_bedrooms, Length: 20640, dtype: float64

In [27]:
df.total_bedrooms.agg(['mean'])

mean    537.870553
Name: total_bedrooms, dtype: float64

In [28]:
df.total_bedrooms.isnull().sum()

207

In [29]:
df.total_bedrooms = df.total_bedrooms.fillna(df.total_bedrooms.mean())

In [30]:
df.total_bedrooms.agg(['mean'])

mean    537.870553
Name: total_bedrooms, dtype: float64

In [31]:
df.total_bedrooms.isnull().sum()

0

In [32]:
df.total_bedrooms.agg(['mean'])

mean    537.870553
Name: total_bedrooms, dtype: float64

In [33]:
island = df[df['ocean_proximity'] == 'ISLAND']
island = island[['housing_median_age', 'total_rooms', 'total_bedrooms']]
island

      housing_median_age  total_rooms  total_bedrooms
8314                27.0       1675.0           521.0
8315                52.0       2359.0           591.0
8316                52.0       2127.0           512.0
8317                52.0        996.0           264.0
8318                29.0        716.0           214.0

In [36]:
X = island.to_numpy()
XTX = np.matmul(np.transpose(X), X)
XTX_inverse = np.linalg.inv(XTX)
y = [950, 1300, 800, 1000, 1300]
w = np.matmul(np.matmul(XTX_inverse, np.transpose(X)), y)
w[-1]

5.699229455065565